CSI API ETABS v1
cDCompColAISC360_22.GetOverwrite Method
 Retrieves the value of a composite column design overwrite item.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetOverwrite(
	string Name,
	int Item,
	ref double Value,
	ref bool ProgDet
)
Function GetOverwrite (
	Name As String,
	Item As Integer,
	ByRef Value As Double,
	ByRef ProgDet As Boolean
) As Integer
Dim instance As cDCompColAISC360_22
Dim Name As String
Dim Item As Integer
Dim Value As Double
Dim ProgDet As Boolean
Dim returnValue As Integer
returnValue = instance.GetOverwrite(Name,
	Item, Value, ProgDet)
int GetOverwrite(
	String^ Name,
	int Item,
	double% Value,
	bool% ProgDet
)
abstract GetOverwrite :
        Name : string *
        Item : int *
        Value : float byref *
        ProgDet : bool byref -> int
Parameters
Name
Type: System.String
 The name of a frame object with a composite column design procedure.
Item
Type: System.Int32
 This is an integer between 1 and 23, inclusive, indicating the overwrite item considered.
Live load reduction factor
Unbraced length ratio, Major
Unbraced length ratio, Minor
Effective length factor, K1 Major
Effective length factor, K1 Minor
Effective length factor, K2 Major
Effective length factor, K2 Minor
Moment coefficient, Cm Major
Moment coefficient, Cm Minor
Nonsway moment factor, B1 Major
Nonsway moment factor, B1 Minor
Sway moment factor, B2 Major
Sway moment factor, B2 Minor
Reduce HSS thickness
HSS welding type
Yield stress, Fy
Expected to specified Fy ratio, Ry
Compressive capacity, Pnc
Tensile capacity, Pnt
Major bending capacity, Mn3
Minor bending capacity, Mn2
Major shear capacity, Vn2
Minor shear capacity, Vn3
Value
Type: System.Double
 The value of the considered overwrite item.
 Live load reduction factor
 Value >= 0; 0 means use program determined value.
 Unbraced length ratio, Major
 Value >= 0; 0 means use program determined value.
 Unbraced length ratio, Minor
 Value >= 0; 0 means use program determined value.
 Effective length factor, K1 Major
 Value >= 0; 0 means use program determined value.
 Effective length factor, K1 Minor
 Value >= 0; 0 means use program determined value.
 Effective length factor, K2 Major
 Value >= 0; 0 means use program determined value.
 Effective length factor, K2 Minor
 Value >= 0; 0 means use program determined value.
 Moment coefficient, Cm Major
 Value >= 0; 0 means use program determined value.
 Moment coefficient, Cm Minor
 Value >= 0; 0 means use program determined value.
 Nonsway moment factor, B1 Major
 Value >= 0; 0 means use program determined value.
 Nonsway moment factor, B1 Minor
 Value >= 0; 0 means use program determined value.
 Sway moment factor, B2 Major
 Value >= 0; 0 means use program determined value.
 Sway moment factor, B2 Minor
 Value >= 0; 0 means use program determined value.
 Reduce HSS thickness
0 = Program Default
1 = No
2 = Yes
 HSS welding type
0 = Program Default
1 = ERW
2 = SAW
 Yield stress, Fy
 Value >= 0; 0 means use program determined value. [F/L^2]
 Expected to specified Fy ratio, Ry
 Value >= 0; 0 means use program determined value.
 Compressive capacity, Pnc
 Value >= 0; 0 means use program determined value. [F]
 Tensile capacity, Pnt
 Value >= 0; 0 means use program determined value. [F]
 Major bending capacity, Mn3
 Value >= 0; 0 means use program determined value. [FL]
 Minor bending capacity, Mn2
 Value >= 0; 0 means use program determined value. [FL]
 Major shear capacity, Vn2
 Value >= 0; 0 means use program determined value. [F]
 Minor shear capacity, Vn3
 Value >= 0; 0 means use program determined value. [F]
ProgDet
Type: System.Boolean
 If this item is True, the specified value is program determined.
Return Value
Type: Int32
 Returns zero if the item is successfully retrieved; otherwise it returns a nonzero value.
Remarks
Examples
Public Sub Example()
   Dim SapModel As cSapModel
   Dim EtabsObject As cOAPI
   Dim ret As Integer = -1
   Dim Value As Double
   Dim ProgDet As Boolean
'create ETABS object
   Dim myHelper as cHelper = New Helper
   EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
'start ETABS application
  ret = EtabsObject.ApplicationStart()
'create SapModel object
   SapModel = EtabsObject.SapModel
'initialize model
   ret = SapModel.InitializeNewModel()
'create steel deck template model
   ret = SapModel.File.NewSteelDeck(4, 12, 12, 4, 4, 24, 24)
'set steel design code
   ret = SapModel.DesignCompositeColumn.SetCode("AISC 360-22")
'run analysis
   System.IO.Directory.CreateDirectory("c:\CSI_API_temp")
   ret = SapModel.File.Save("C:\CSI_API_temp\example.edb")
   ret = SapModel.Analyze.RunAnalysis
'get overwrite item
   ret = SapModel.DesignCompositeColumn.AISC360_22.GetOverwrite("8", 1, Value, ProgDet)
'close ETABS
   EtabsObject.ApplicationExit(False)
'clean up variables
   SapModel = Nothing
   EtabsObject = Nothing
End Sub
See Also
Reference
cDCompColAISC360_22 Interface
ETABSv1 Namespace